# 1) SQL QUERY FOR BOOKING & REVENUE

In [1]:
import pandas as pd
import sqlalchemy
import pymysql
import numpy as np
import datetime
import calendar
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT billing_cust_city, Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,
delivery_status,
COUNT(order_id) Bookings, 	
		
SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)
   AND channel_user NOT IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
   AND channel_user IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
   AND channel_user IN (92),1,
   IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)AND channel_user IN (92),1,                                                                   
    0))))))) 'Allocated_count',
                          
SUM(IF((is_sample_collected = 1 AND channel_type=0),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
AND channel_type<>0 AND payed_amount>0),1,0))))) 'Picked_Orders', 

SUM(IF(delivery_status IN (3),1,0)) AS 'Cancelled_orders',

SUM(IF(delivery_status IN (13,26,27),1,0)) AS 'Rescheduled_OnHold_Orders',
                     
                     
                     SUM(IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
                         IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
                         IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
                         AND channel_type<>0 AND payed_amount>0),1,0)))) 'Picked Orders_B2B', 
                     

                   SUM(IF(ref_booking_id = 0 AND delivery_status IN (0,-1,3,13),order_price,IF(ref_booking_id = 0 
                       AND delivery_status NOT IN (0,-1,3,13),allocated_amount,0))) 'BOOKING_AMOUNT',
                   
                   
		   SUM(IF(DATE(order_date) < CURDATE(),IF(delivery_status IN (0,-1,3,13), order_price, 
		   IF(DATE(sample_collection_time) <= CURDATE(), allocated_amount, order_price)), 
		   IF(delivery_status NOT IN (0,-1,3),order_price,0))) AS 'booking_amount_New',
                     
                   
                   
                          SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)
                          AND channel_user NOT IN (92),allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date 
                          AND channel_user IN (92),99,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date 
                          AND channel_user IN (92),99,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13)AND channel_user IN (92),99,                                                                   
                          0))))))) 'Allocated_amount',
                                    
                     
         
                     SUM(IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
                     IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0)))) 'Overall_Revenue',
                     
                     
                     SUM(IF((New_no = Old_no AND is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((New_no = Old_no AND is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue_Existing',
                     
                   
                     
                     SUM(IF(is_sample_collected = 1 AND channel_type=0, payed_amount,0)) 'Revenue_B2C',
                     
                     SUM(IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
                     IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Revenue_B2B',
                     
                     
                     SUM(IF((booked_from != 'phlebo_app' AND is_sample_collected=1
                     AND payed_amount > allocated_amount),payed_amount - allocated_amount,
                     IF((booked_from = 'phlebo_app' AND is_sample_collected=1),payed_amount,0))) 
                     'Phlebo_addon',

               
                     
                     SUM(IF(sample_collection_time > NOW()
                     AND delivery_status NOT IN (-1,0,1,3,13,18,23),order_price,0)) need_to_be_collected ,
                     SUM(Existing_cust_order_count) 'Existing_cust_order',
                     COUNT(DISTINCT c_order_id) 'customer_count'
                     
                     FROM (
                     SELECT X.billing_cust_tel 'Old_no',X1.billing_cust_tel 'New_no',
                     IF(X.billing_cust_tel = X1.billing_cust_tel,1,0)'Existing_cust_order_count',                     
                     X.is_sample_collected, X.sample_collecor_id,allocated_amount,billing_cust_city,
                     X.order_id, X.ref_booking_id,X.order_price, X.payed_amount, X.sample_collection_time, 
                     X.order_date, X.delivery_status,X.booked_from,X.created_by,X.channel_type,
                     X.Agent_name,X.Manager_Name,X.Dept_Name,DATE(X.sample_collection_time) 'Sample_Date',X1.Max_date,
                     X.cancelled_date,X.reshedule_date,
                     cancelled_after,reshedule_after,X.allocated_amount_new,X.allocated_count_new, X.c_order_id,X.channel_user
                                 
                     FROM
                     
                     (SELECT d.billing_cust_tel,d.is_sample_collected, d.sample_collecor_id,allocated_amount,billing_cust_city,
                     GROUP_CONCAT(DISTINCT u.contact_number), d.order_id, d.ref_booking_id,d.order_price, d.payed_amount, d.sample_collection_time, 
                     d.order_date, d.delivery_status,d.booked_from,d.created_by,d.channel_type,
                     IF(d.booked_from = 'crm',cu.name,IF(d.booked_from = 'phlebo_app',sc.name,0))
                     AS 'Agent_name',IF(d.booked_from = 'crm',cu1.name, IF(d.booked_from = 'phlebo_app',cu2.name,0)) AS 'Manager_Name',
                     IF(d.booked_from = 'crm',dm.dept_name,IF(d.booked_from='phlebo_app',dm1.dept_name,0)) AS 'Dept_Name',
                     camp_id,od.cancelled_date, d.reshedule_date,c_order_id,
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,0) 'cancelled_after',
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,0) 'reshedule_after',
                     
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),allocated_amount,0))) 'allocated_amount_new',
                          
                      IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),1,0))) 'allocated_count_new',d.channel_user
                     
                     
                     FROM deal_order_management d 
                     LEFT JOIN deal_orders_child doc ON d.order_id = doc.order_id
                     LEFT JOIN order_details od ON doc.c_order_id = od.doc_id 
                     LEFT JOIN deal_user_management u ON doc.cust_id = u.user_id 
                    
                     LEFT JOIN crm_users AS cu ON d.created_by = cu.id
                     LEFT JOIN sample_collector sc ON d.created_by = sc.sid
                     LEFT JOIN crm_users AS cu1 ON cu1.id = cu.reporting_to
                     LEFT JOIN crm_users AS cu2 ON sc.supervisorID = cu2.id
                     LEFT JOIN dept_master AS dm ON dm.id = cu.dept_id
                     LEFT JOIN dept_master AS dm1 ON dm1.id = sc.dept_id
                     WHERE DATE(d.sample_collection_time) = CURDATE()
                     GROUP BY d.order_id) X
                     LEFT JOIN
                     (SELECT dom.billing_cust_tel, MAX(DATE(dom.sample_collection_time)) 'Max_date', COUNT(dom.order_id) FROM deal_order_management dom
                     WHERE DATE(dom.sample_collection_time) < (LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY) GROUP BY dom.billing_cust_tel) X1
                     ON X.billing_cust_tel = X1.billing_cust_tel GROUP BY X.order_id) X2
                     GROUP BY billing_cust_city,Sample_Date,Agent_name,dept_name'''
df_master = pd.read_sql_query(query,engine)
engine.dispose()
df_master.head()

,billing_cust_city,Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,delivery_status,Bookings,Allocated_count,Picked_Orders,...,booking_amount_New,Allocated_amount,Overall_Revenue,Overall_Revenue_Existing,Revenue_B2C,Revenue_B2B,Phlebo_addon,need_to_be_collected,Existing_cust_order,customer_count
0,Agra,2019-09-13,Gayatri Vibhar,Saraswati,Inbound Sales,crm,13,1,1.0,0.0,...,1399.0,1399.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1
1,Agra,2019-09-13,Prince Sood,Ashish Chandra,Outbound Sales,crm,8,1,1.0,1.0,...,998.0,998.0,1048.0,0.0,1048.0,0.0,50.0,0.0,0.0,1
2,Agra,2019-09-13,Saud Chaudhary,Bhawna Anand,Outbound Sales,crm,3,1,0.0,0.0,...,1519.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1
3,Ahmedabad,2019-09-13,Amit Kumar,Bhawna Anand,Outbound Sales,crm,15,1,1.0,1.0,...,2549.0,2549.0,2499.0,0.0,2499.0,0.0,0.0,0.0,0.0,1
4,Ahmedabad,2019-09-13,Arif Khan,Prateek Sharma,Outbound Sales,crm,15,1,1.0,1.0,...,3049.0,3049.0,3059.0,0.0,3059.0,0.0,10.0,0.0,0.0,1

# 2) SQL QUERY FOR GROSS MARGIN

In [2]:

engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT x1.payed_amount,SUM(x2.lab_cost) sum_addon_cost,x1.sample_collection_time,x1.order_id,SUM(order_count) orders, 
x1.billing_cust_city,DATE(x1.sample_collection_time)
FROM

(SELECT dom1.order_id,
 IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
 IF((is_sample_collected = 1 AND channel_user = 92 AND channel_type <>0),99,
 IF((is_sample_collected=1 AND channel_user NOT IN (92) AND channel_type<>0 AND payed_amount>0),payed_amount,0)))'payed_amount',

IF((is_sample_collected = 1 AND channel_type=0),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND channel_user IN (92,191)),1,
IF((is_sample_collected = 1 AND channel_type<>0 AND booked_from IN ('Netmeds')),1,
IF((is_sample_collected=1 AND channel_user NOT IN (92,191) AND booked_from NOT IN ('Netmeds') 
AND channel_type<>0 AND payed_amount>0),1,0))))'order_count', 

sample_collection_time,billing_cust_city
FROM deal_order_management dom1
WHERE DATE(dom1.sample_collection_time) = curdate()
AND dom1.is_sample_collected=1
GROUP BY dom1.order_id)x1
LEFT JOIN
(SELECT SUM(od.addon_cost)AS lab_cost,dom.payed_amount AS payed_amount,dom.sample_collection_time,dom.order_id, billing_cust_city, dom.booked_from,
 dom.allocated_amount,DATE(dom.sample_collection_time)
	
	FROM deal_order_management dom LEFT JOIN deal_orders_child doc ON dom.order_id = doc.order_id
LEFT JOIN order_details od ON doc.c_order_id = od.doc_id

WHERE od.id IS NOT NULL AND
dom.is_sample_collected = 1 AND 
dom.delivery_status NOT IN (-1,0,3,13) AND
(od.order_delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) OR  od.order_delivery_status IS NULL)
AND od.addon_flag !=-1 
AND DATE(dom.sample_collection_time) = curdate()
AND (dom.role_id NOT IN (6,27) AND dom.created_by NOT IN (124,230,509))
GROUP BY dom.order_id) x2 ON x1.order_id = x2.order_id
GROUP BY x1.order_id'''
df_margin = pd.read_sql_query(query,engine)
engine.dispose()
df_margin.head()

,payed_amount,sum_addon_cost,sample_collection_time,order_id,orders,billing_cust_city,DATE(x1.sample_collection_time)
0,0,522.0,2019-09-13 06:30:00,1708711812,1.0,Jaipur,2019-09-13
1,0,522.0,2019-09-13 08:00:00,1723892836,1.0,Lucknow,2019-09-13
2,0,30.0,2019-09-13 09:00:00,1728512937,1.0,Delhi,2019-09-13
3,2077,719.0,2019-09-13 07:00:00,1729119571,1.0,Mumbai,2019-09-13
4,3500,1240.0,2019-09-13 06:00:00,1729435640,1.0,Noida,2019-09-13

# 3) SQL QUERY FOR LEADS DATA

In [3]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT mas.city_check_final AS 'CITY', mas.Google_Facebook AS 'Leads_Tag',DATE(mas.xcreated) 'created_on',
COUNT(DISTINCT mas.lead_id) AS 'Leads' FROM 
(
SELECT  DISTINCT	 
	 IF(IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),
		IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))) IS NULL,LEFT(lal.utm_campaign,LOCATE('-',lal.utm_campaign)-1),
		  
		  IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))))	
		  AS city_check_final,
		  IF(lal.lead_source IN (3,4,118,122), "Premium leads","Non Premium leads") AS lead_tag,
		  IF(lal.lead_source = 3,"Facebook",IF(lal.lead_source IN (4,69,118,122),"Google",
		  IF(lal.lead_source IN (13,14,15,16,27,28,36,37,38,44,49,50,52,79,82,93,101,116),"SMS_Campaigns","Others")))'Google_Facebook',

lm.lead_id,dom.order_id,lal.lead_source,dc.city_name,DATE(lal.created_on) 'xcreated'
FROM lead_master AS lm
LEFT JOIN 
lead_activity_log AS lal ON lm.lead_id = lal.lead_id 
LEFT JOIN
deal_order_management AS dom ON dom.billing_cust_tel = lm.contact_number AND DATE(dom.order_date) >= DATE(lal.created_on)
LEFT JOIN
lead_source AS ls ON ls.id = lal.lead_source
LEFT JOIN
deal_city AS dc ON lal.lead_city = dc.city_id
LEFT JOIN
crm_users AS cu ON cu.id = lal.agent_id
WHERE DATE(lal.created_on) = (CURDATE() - INTERVAL 1 day)
AND lal.is_new_interest=1) AS mas
GROUP BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)
ORDER BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)'''
df_lead = pd.read_sql_query(query,engine)
engine.dispose()
df_lead.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'haryana'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Delhi'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'NCR'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'Lucknow'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect INTEGER value: 'ncr'")
  result = self._query(query)

   CITY      Leads_Tag  created_on  Leads
0  None       Facebook  2019-09-12     18
1  None         Google  2019-09-12      8
2  None         Others  2019-09-12   1243
3  None  SMS_Campaigns  2019-09-12     18
4             Facebook  2019-09-12    110

In [4]:
df_lead.to_csv('df_lead.csv')

# 4) SQL QUERY FOR KIT COST

In [5]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT xdate, billing_cust_city, SUM(IF(bd = 'not_bd',custs,0)) 'NON_BD_customers'
FROM
(SELECT order_id, MIN(DATE(b1.sample_collection_time)) xmin, MAX(DATE(b1.sample_collection_time)) xmax, 
billing_cust_city, bd, COUNT(DISTINCT cust_id) custs, DATE(sample_collection_time) AS xdate
FROM
(SELECT d1.order_id, d1.cust_id, d.delivery_status, d.sample_collection_time, 
IF(d.billing_cust_city = 23,'Gurgaon',IF(d.billing_cust_city = 1595,'Delhi',d.billing_cust_city)) billing_cust_city, d.is_sample_collected, d.billing_cusT_name, d1.customer_name, d.payed_amount,
IF(d.channel_type = 0,'not_bd','bd') bd
FROM deal_order_management d
LEFT JOIN deal_orders_child d1
ON d.order_id = d1.order_id
WHERE DATE(d.sample_collection_time) = CURDATE()
AND is_sample_collected = 1
AND d.delivery_status IN (7,8,9,12,15,21,23,18,26,25,27,28)) b1
GROUP BY order_id) b2
GROUP BY billing_cust_city, xdate
ORDER BY 'NON_BD_customers' DESC'''
df_kit = pd.read_sql_query(query,engine)
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
engine.dispose()
df_kit.head()

C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Jaipur'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Lucknow'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Delhi'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Mumbai'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Noida'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Kanpur'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Jalandhar'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Bhopal'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Amritsar'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Bengaluru'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Ludhiana'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Ghaziabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Pune'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Faridabad'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Ambala'")
  result = self._query(query)
C:\Users\nitesh.kumar\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1292, "Truncated incorrect DOUBLE value: 'Hyderabad'")
  result = self._query(query)

        xdate billing_cust_city  NON_BD_customers  kit_cost
0  2019-09-13            Jaipur              13.0     435.5
1  2019-09-13           Lucknow              50.0    1675.0
2  2019-09-13             Delhi             262.0    8777.0
3  2019-09-13            Mumbai              77.0    2579.5
4  2019-09-13             Noida              38.0    1273.0

In [6]:
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
df_kit.head()

        xdate billing_cust_city  NON_BD_customers  kit_cost
0  2019-09-13            Jaipur              13.0     435.5
1  2019-09-13           Lucknow              50.0    1675.0
2  2019-09-13             Delhi             262.0    8777.0
3  2019-09-13            Mumbai              77.0    2579.5
4  2019-09-13             Noida              38.0    1273.0

# 5) SQL QUERY FOR FACEBOOK COST

In [7]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,3,LOCATE(',',lcd.campaign_name,1)-3)
AS 'city',ROUND(SUM(sms_rate),2) AS 'Facebook_cost' FROM `lead_campaign_detail` lcd 
WHERE DATE(Date_time) = (CURDATE() - INTERVAL 1 day)
GROUP BY city'''
df_FBcost = pd.read_sql_query(query,engine)
engine.dispose()
df_FBcost.head()

        city  Facebook_cost
0                 152308.40
1       AGRA        1957.23
2  AHMEDABAD        5018.23
3   AMRITSAR        4047.60
4  Bengaluru       12021.31

# 6) SQL QUERY FOR GOOGLE COST

In [8]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,1,LOCATE(':',lcd.campaign_name,1)-1) AS 'city',ROUND(SUM(sms_rate),2) AS 'Google_cost' 
FROM lead_campaign_detail lcd
WHERE lcd.vendor_id IN (4,69,118,122) AND DATE(Date_time) = (CURDATE() - INTERVAL 1 day)
GROUP BY city'''
df_Googlecost = pd.read_sql_query(query,engine)
engine.dispose()
df_Googlecost.head()

         city  Google_cost
0                  1439.37
1   Ahmedabad      1191.40
2  Bangalore      21809.35
3     Haryana      1622.74
4   Hyderabad     14649.93

# 7) SQL QUERY FOR CITY & STATE

In [9]:
%pwd
%cd D:\Raw_Data\City Vs State
df_city = pd.read_csv('city_vs_state.csv')

D:\Raw_Data\City Vs State

# 8) SQL QUERY FOR REFUND AMOUNT

In [10]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT city_name, Refund_month,SUM(refund) 'refund_amt'
FROM(
SELECT rp.booking_id,rp.created_at,rp.updated_at,rp.status,DATE(dom.sample_collection_time),SUM(rp.refund_amount) refund,
MONTHNAME(rp.transaction_date) Refund_month,rp.transaction_date,billing_cust_city city_name FROM refund_process rp 
LEFT JOIN deal_order_management dom ON dom.order_id = rp.booking_id
WHERE DATE(rp.transaction_date) = CURDATE()
AND rp.payment_status =1
GROUP BY rp.booking_id)x1
GROUP BY city_name,Refund_month'''
df_refund = pd.read_sql_query(query,engine)
engine.dispose()
df_refund.head()

   city_name Refund_month  refund_amt
0  Hyderabad    September       509.0

# 9) SQL QUERY FOR PHLEBO CONVEYANCE

In [11]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT scz.zone_name,SUM(optimal_distance_traveled),SUM(actual_distance_traveled), 
SUM(ROUND(actual_distance_traveled*2.5,0)) AS conveyance
FROM `phlebo_travel_report` AS ptr
LEFT JOIN sample_collector AS sc ON ptr.sample_collector_id = sc.sid
LEFT JOIN sample_collection_zone AS scz ON scz.zone_id = ptr.zone_id
WHERE travel_date = curdate()
GROUP BY scz.zone_name'''
df_conveyance = pd.read_sql_query(query,engine)
engine.dispose()
df_conveyance.head()

,zone_name,SUM(optimal_distance_traveled),SUM(actual_distance_traveled),conveyance
0,Agra,32.073,32.334,81.0
1,ahmedabad,108.332,117.631,294.0
2,Ambala,52.116,73.376,183.0
3,Amritsar,129.469,220.670,552.0
4,Bengaluru Zone 1-Kalyan Nagar,52.388,138.664,346.0

# 10) No. of days MTD & overall

In [12]:
now = datetime.datetime.now()
mtd_days=1
overall_days=calendar.monthrange(now.year, now.month)[1]

# 11) Booking & Revenue DETAILED

In [13]:
dfg2 = df_master.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfg3=dfg2.drop(columns = 'Lead_City')
dfg4=pd.DataFrame(dfg3.groupby(['State'])['Bookings'].sum())
dfg4.head()
dfg4.reset_index(inplace=True)

var = ['BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']
for num_var in var:
    dfg5=pd.DataFrame(dfg3.groupby(['State'])[num_var].sum())
    dfg4=pd.merge(dfg4,dfg5,left_on = 'State',right_on = 'State',how = 'inner')
    
dfg7=dfg4[['State','Bookings','BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']]

def var_sum(x):
    return pd.Series(np.sum(x))


dfg7 = dfg7._get_numeric_data().apply(lambda x : var_sum(x))

df_gross=pd.concat([dfg4,dfg7],sort=False)

df_gross['State'].fillna('Total',inplace = True)
df_gross

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon
0,Ahmedabad,11,15688.0,6.0,10542.0,4.0,1.0,6.0,10901.0,409.0
1,BLR,53,59363.0,47.0,59093.0,4.0,10.0,37.0,44657.0,983.0
2,Dehradun,28,21750.0,25.0,18903.0,3.0,4.0,20.0,22156.0,9897.0
3,HR,17,20717.0,16.0,20717.0,0.0,4.0,12.0,19451.0,4060.0
4,Hyderabad,37,35880.0,32.0,39964.0,4.0,11.0,20.0,30090.0,1398.0
5,Jaipur,17,16628.0,15.0,18408.0,1.0,2.0,14.0,19691.0,4407.0
6,MP,10,21248.0,10.0,22246.0,1.0,1.0,8.0,11204.0,0.0
7,Mumbai,87,111826.0,71.0,112041.0,14.0,16.0,56.0,90474.0,8089.0
8,NCR,477,536679.0,416.0,498422.0,26.0,54.0,368.0,493666.0,75223.0
9,PCM,23,26796.0,18.0,18015.0,1.0,1.0,16.0,19719.0,4000.0
10,Pune,30,36669.0,20.0,26442.0,4.0,14.0,5.0,7119.0,0.0
11,Punjab,48,70248.0,42.0,63878.0,6.0,4.0,37.0,84155.0,27025.0
12,UP,65,69245.0,57.0,63267.0,4.0,8.0,51.0,61061.0,9714.0
0,Total,903,1042737.0,775.0,971938.0,72.0,130.0,650.0,914344.0,145205.0

# 22) GROSS MARGIN DETAILED

In [14]:
df_margin['payed_amount']=df_margin['payed_amount'].apply(pd.to_numeric)

dfm2 = df_margin.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfm3=dfm2.drop(columns = 'Lead_City')
dfm4=pd.DataFrame(dfm3.groupby(['State'])['payed_amount'].sum())
dfm4.head()
dfm4.reset_index(inplace=True)

dfm5=pd.DataFrame(dfm3.groupby(['State'])['sum_addon_cost'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')
dfm5=pd.DataFrame(dfm3.groupby(['State'])['orders'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')

p=379178/overall_days*mtd_days
r=162293/overall_days*mtd_days

q_BLR=np.sum(dfm4.iloc[0:1,-1:])
q_BLR

q_HYD=np.sum(dfm4.iloc[3:4,-1:])
q_HYD

q_MP=np.sum(dfm4.iloc[5:6,-1:])
q_MP

cost_prop_BLR = np.sum(p*(q_BLR/(q_HYD+q_BLR)))
cost_prop_BLR

cost_prop_HYD = np.sum(p*(q_HYD/(q_HYD+q_BLR)))
cost_prop_HYD

cost_prop_MP = np.sum(r)
cost_prop_MP

dfm4['blr_cost']=dfm4['State'].apply(lambda x:cost_prop_BLR if x=='BLR' else cost_prop_HYD if x=='Hyderabad' else 
                                     cost_prop_MP if x=='MP' else 0.0) 
dfm4['Total_Cost']=dfm4['sum_addon_cost']+dfm4['blr_cost']
dfm4['Gross_Margin']=dfm4['payed_amount']-dfm4['Total_Cost']
dfm5=dfm4[['payed_amount', 'sum_addon_cost', 'orders', 'blr_cost',
        'Total_Cost', 'Gross_Margin']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfm5 = dfm5._get_numeric_data().apply(lambda x : var_sum(x))

dfm4=pd.concat([dfm4,dfm5],sort=False)
dfm4['State'].fillna('Total',inplace = True)

dfm4['Gross_Margin']=round(dfm4['Gross_Margin'],0)
dfm4['Gross_Margin/order']=round(dfm4['Gross_Margin']/dfm4['orders'],0)
dfm4['Gross_Margin%']=round(dfm4['Gross_Margin']/dfm4['payed_amount'],2)
dfm4['ASP']=round(dfm4['payed_amount']/dfm4['orders'],0)
df_margin_final=dfm4[['State','Gross_Margin','Gross_Margin/order','Gross_Margin%','ASP']]
df_margin_final

        State  Gross_Margin  Gross_Margin/order  Gross_Margin%     ASP
0   Ahmedabad        6888.0              1148.0           0.63  1817.0
1         BLR       30178.0               816.0           0.68  1207.0
2    Dehradun       15005.0               750.0           0.68  1108.0
3          HR       11774.0               981.0           0.61  1621.0
4   Hyderabad       14451.0               723.0           0.48  1504.0
5      Jaipur       12597.0               900.0           0.64  1406.0
6          MP        1699.0               212.0           0.15  1400.0
7      Mumbai       53407.0               954.0           0.59  1616.0
8         NCR      325305.0               884.0           0.66  1341.0
9         PCM       12900.0               806.0           0.65  1232.0
10       Pune        4150.0               830.0           0.58  1424.0
11     Punjab       49825.0              1347.0           0.59  2274.0
12         UP       38814.0               761.0           0.64  1197.0
0       Total      576994.0               888.0           0.63  1407.0

# 33) LEADS DATA DETAILED

In [15]:
df_lead.dropna(axis=0,how = 'any').shape

dfl2 = df_lead.merge(df_city,left_on ='CITY',right_on = 'Lead_City', how = 'inner')
dfl3=dfl2.drop(columns = ['Lead_City'])
dfl3=dfl3.drop_duplicates(keep='last')

dfl4=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Facebook')].groupby(['State'])['Leads'].sum())
dfl4.reset_index(inplace=True)

dfl5=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Google')].groupby(['State'])['Leads'].sum())

dfl4=pd.merge(dfl4,dfl5,left_on = 'State',right_on = 'State', how = 'inner')
dfl4.rename(columns={'Leads_x':'Facebook','Leads_y':'Google'},inplace=True)

dfl6 = dfl4[['Facebook','Google']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfl6 = dfl6._get_numeric_data().apply(lambda x : var_sum(x))

df_lead_final=pd.concat([dfl4,dfl6],sort=False)
df_lead_final['State'].fillna('Total',inplace = True)
df_lead_final

        State  Facebook  Google
0   Ahmedabad        50       3
1         BLR        40      67
2          HR        17       8
3   Hyderabad        51      56
4      Jaipur        25      14
5          MP        56       6
6      Mumbai       209      61
7         NCR       137     185
8         PCM        20      11
9        Pune        45      33
10     Punjab        67      12
11         UP        88      37
0       Total       805     493

# 44) KIT COST DETAILED

In [16]:
dfk2 = df_kit.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfk3=dfk2.drop(columns = 'Lead_City')
dfk4=pd.DataFrame(dfk3.groupby(['State'])['kit_cost'].sum())
dfk4.head()
dfk4.reset_index(inplace=True)
dfk5 = dfk4[['kit_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfk5 = dfk5._get_numeric_data().apply(lambda x : var_sum(x))

df_kit_Final=pd.concat([dfk4,dfk5],sort=False)
df_kit_Final['State'].fillna('Total',inplace = True)
df_kit_Final

        State  kit_cost
0   Ahmedabad     301.5
1         BLR    1675.0
2    Dehradun     536.0
3          HR     569.5
4   Hyderabad    1038.5
5      Jaipur     435.5
6          MP     603.0
7      Mumbai    2579.5
8         NCR   16314.5
9         PCM     703.5
10       Pune     100.5
11     Punjab    2378.5
12         UP    2378.5
0       Total   29614.0

# 55) FACEBOOK COST DETAILED

In [17]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dfc1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].dropna(inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Facebook_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Facebook_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_fbcost_final=pd.concat([dfc2,dfc3],sort=False)
df_fbcost_final['State'].fillna('Total',inplace = True)
df_fbcost_final

        State  Facebook_cost
0   Ahmedabad        5018.23
1         BLR       12021.31
2    Dehradun        2806.03
3          HR        3583.26
4   Hyderabad        5768.35
5      Jaipur        3468.78
6          MP        5812.90
7      Mumbai       35888.01
8         NCR       25545.16
9         PCM        4222.75
10       Pune       13419.34
11     Punjab        4217.22
12         UP       13549.90
0       Total      135321.24

# 66) GOOGLE COST DETAILED

In [18]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Google_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Google_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_Googlecost_final=pd.concat([dfc2,dfc3],sort=False)
df_Googlecost_final['State'].fillna('Total',inplace = True)
df_Googlecost_final

        State  Google_cost
0   Ahmedabad      1191.40
1         BLR     21809.35
2    Dehradun      2408.06
3          HR      1622.74
4   Hyderabad     14649.93
5      Jaipur      4304.63
6          MP      3187.65
7      Mumbai     18808.14
8         NCR     59100.96
9         PCM      3503.06
10       Pune     10038.86
11     Punjab      2378.96
12         UP      9304.66
0       Total    152308.40

# 88) REFUND DETAILED

In [19]:
dfr2 = df_city.merge(df_refund,left_on ='Lead_City',right_on = 'city_name', how = 'left')

dfr2['refund_amt'].replace(np.NaN,0)
dfr3=dfr2.drop(columns = 'Lead_City')
dfr4=pd.DataFrame(dfr3.groupby(['State'])['refund_amt'].sum())
dfr4.reset_index(inplace=True)


dfr5 = dfr4[['refund_amt']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfr5 = dfr5._get_numeric_data().apply(lambda x : var_sum(x))

df_refund_Final=pd.concat([dfr4,dfr5],sort=False)
df_refund_Final['State'].fillna('Total',inplace = True)
df_refund_Final

        State  refund_amt
0   Ahmedabad         0.0
1         BLR         0.0
2    Dehradun         0.0
3          HR         0.0
4   Hyderabad       509.0
5      Jaipur         0.0
6          MP         0.0
7      Mumbai         0.0
8         NCR         0.0
9         PCM         0.0
10       Pune         0.0
11     Punjab         0.0
12         UP         0.0
0       Total       509.0

# 99) PHLEBO CONVEYANCE DETAILED

In [20]:
dfc2 = df_city.merge(df_conveyance,left_on ='Lead_City',right_on = 'zone_name', how = 'left')

dfc2['conveyance'].replace(np.NaN,0)
dfc3=dfc2.drop(columns = 'Lead_City')
dfc4=pd.DataFrame(dfc3.groupby(['State'])['conveyance'].sum())
dfc4.reset_index(inplace=True)


dfc5 = dfc4[['conveyance']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc5 = dfc5._get_numeric_data().apply(lambda x : var_sum(x))

df_conveyance_Final=pd.concat([dfc4,dfc5],sort=False)
df_conveyance_Final['State'].fillna('Total',inplace = True)
df_conveyance_Final

        State  conveyance
0   Ahmedabad       294.0
1         BLR      1048.0
2    Dehradun       294.0
3          HR       786.0
4   Hyderabad      1062.0
5      Jaipur       239.0
6          MP       331.0
7      Mumbai     16474.0
8         NCR      5647.0
9         PCM       234.0
10       Pune       216.0
11     Punjab      1839.0
12         UP      1316.0
0       Total     29780.0

# FINAL MERGING OF ALL DF

In [21]:
df_FTD_FINAL1 = pd.merge(df_gross,df_margin_final,left_on='State',right_on='State',how='left')

In [22]:
df_FTD_FINAL2=pd.merge(df_FTD_FINAL1,df_lead_final,left_on='State',right_on='State',how='left')

In [23]:
df_FTD_FINAL3=pd.merge(df_FTD_FINAL2,df_kit_Final,left_on='State',right_on='State',how='left')

In [24]:
df_FTD_FINAL4=pd.merge(df_FTD_FINAL3,df_fbcost_final,left_on='State',right_on='State',how='left')

In [25]:
df_FTD_FINAL5=pd.merge(df_FTD_FINAL4,df_Googlecost_final,left_on='State',right_on='State',how='left')

In [26]:
df_FTD_FINAL6=pd.merge(df_FTD_FINAL5,df_refund_Final,left_on='State',right_on='State',how='left')

In [27]:
df_FTD_FINAL7=pd.merge(df_FTD_FINAL6,df_conveyance_Final,left_on='State',right_on='State',how='left')
df_FTD_FINAL7

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon,...,Gross_Margin/order,Gross_Margin%,ASP,Facebook,Google,kit_cost,Facebook_cost,Google_cost,refund_amt,conveyance
0,Ahmedabad,11,15688.0,6.0,10542.0,4.0,1.0,6.0,10901.0,409.0,...,1148.0,0.63,1817.0,50.0,3.0,301.5,5018.23,1191.40,0.0,294.0
1,BLR,53,59363.0,47.0,59093.0,4.0,10.0,37.0,44657.0,983.0,...,816.0,0.68,1207.0,40.0,67.0,1675.0,12021.31,21809.35,0.0,1048.0
2,Dehradun,28,21750.0,25.0,18903.0,3.0,4.0,20.0,22156.0,9897.0,...,750.0,0.68,1108.0,NaN,NaN,536.0,2806.03,2408.06,0.0,294.0
3,HR,17,20717.0,16.0,20717.0,0.0,4.0,12.0,19451.0,4060.0,...,981.0,0.61,1621.0,17.0,8.0,569.5,3583.26,1622.74,0.0,786.0
4,Hyderabad,37,35880.0,32.0,39964.0,4.0,11.0,20.0,30090.0,1398.0,...,723.0,0.48,1504.0,51.0,56.0,1038.5,5768.35,14649.93,509.0,1062.0
5,Jaipur,17,16628.0,15.0,18408.0,1.0,2.0,14.0,19691.0,4407.0,...,900.0,0.64,1406.0,25.0,14.0,435.5,3468.78,4304.63,0.0,239.0
6,MP,10,21248.0,10.0,22246.0,1.0,1.0,8.0,11204.0,0.0,...,212.0,0.15,1400.0,56.0,6.0,603.0,5812.90,3187.65,0.0,331.0
7,Mumbai,87,111826.0,71.0,112041.0,14.0,16.0,56.0,90474.0,8089.0,...,954.0,0.59,1616.0,209.0,61.0,2579.5,35888.01,18808.14,0.0,16474.0
8,NCR,477,536679.0,416.0,498422.0,26.0,54.0,368.0,493666.0,75223.0,...,884.0,0.66,1341.0,137.0,185.0,16314.5,25545.16,59100.96,0.0,5647.0
9,PCM,23,26796.0,18.0,18015.0,1.0,1.0,16.0,19719.0,4000.0,...,806.0,0.65,1232.0,20.0,11.0,703.5,4222.75,3503.06,0.0,234.0
10,Pune,30,36669.0,20.0,26442.0,4.0,14.0,5.0,7119.0,0.0,...,830.0,0.58,1424.0,45.0,33.0,100.5,13419.34,10038.86,0.0,216.0
11,Punjab,48,70248.0,42.0,63878.0,6.0,4.0,37.0,84155.0,27025.0,...,1347.0,0.59,2274.0,67.0,12.0,2378.5,4217.22,2378.96,0.0,1839.0
12,UP,65,69245.0,57.0,63267.0,4.0,8.0,51.0,61061.0,9714.0,...,761.0,0.64,1197.0,88.0,37.0,2378.5,13549.90,9304.66,0.0,1316.0
13,Total,903,1042737.0,775.0,971938.0,72.0,130.0,650.0,914344.0,145205.0,...,888.0,0.63,1407.0,805.0,493.0,29614.0,135321.24,152308.40,509.0,29780.0

In [28]:
from openpyxl import load_workbook
book = load_workbook('leads_summary.xlsx')
writer = pd.ExcelWriter('leads_summary.xlsx', engine='openpyxl')
writer.book = book
df_FTD_FINAL7.to_excel(writer,sheet_name="FTD",header='infer', index=False,startcol=0,startrow=0)
writer.save()